Revit 2027 API
NumberSystem.NumberDisplayRule Property
 The display rule of the number system.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public NumberSystemDisplayRule NumberDisplayRule { get; set; }
Public Property NumberDisplayRule As NumberSystemDisplayRule
	Get
	Set
public:
property NumberSystemDisplayRule NumberDisplayRule {
	NumberSystemDisplayRule get ();
	void set (NumberSystemDisplayRule value);
}
member NumberDisplayRule : NumberSystemDisplayRule with get, set
Property Value
NumberSystemDisplayRule
Exceptions
Exception | Condition
ArgumentOutOfRangeException |  When setting this property: A value passed for an enumeration argument is not a member of that enumeration
See Also
Reference
NumberSystem Class
Autodesk.Revit.DB Namespace